tutorials/combustion/fireFoam/les/oppositeBurningPanels/constant/thermophysicalProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType hsPsiMixtureThermo<singleStepReactingMixture<gasThermoPhysics>>;


inertSpecie N2;
fuel        C3H8;

chemistryReader foamChemistryReader;

foamChemistryFile "$FOAM_CASE/constant/reactions";

foamChemistryThermoFile "$FOAM_CASE/constant/thermo.compressibleGas";


liquids
{
    liquidComponents
    ();

    H2O             H2O defaultCoeffs;
}


solids
{
    solidComponents
    ();
}
