tutorials/combustion/fireFoam/les/oppositeBurningPanels/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss limitedLinear 1;
    div(phi,k)      Gauss limitedLinear 1;
    div(phi,Yi_hs)  Gauss multivariateSelection
    {
        O2              limitedLinear01 1;
        N2              limitedLinear01 1;
        C3H8            limitedLinear01 1;
        H2O             limitedLinear01 1;
        CO2             limitedLinear01 1;
        hs              limitedLinear 1;
    };
    div((muEff*dev2(T(grad(U))))) Gauss linear;
    div(phiU,p)         Gauss linear;
    div(Ji,Ii_h)        Gauss upwind;
}

laplacianSchemes
{
    //default         none;
    default         Gauss linear corrected;
    laplacian(muEff,U) Gauss linear corrected;
    laplacian(DkEff,k) Gauss linear corrected;
    laplacian(alphaEff,hs) Gauss linear corrected;
    laplacian((((rho*(1|A(U)))*rho)*gh)) Gauss linear corrected;
    laplacian(interpolate((rho*(1|A(U)))),p) Gauss linear corrected;
    laplacian(gammaRad,G) Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p_rgh;
}


// ************************************************************************* //
